export const TEXT = {
  slogan: 'GROWL TO GROWTH',
  about:
    '멋쟁이 사자처럼은 자신이 생각했던 아이디어를 구체화하고 프로그래밍 교육을 통해 웹서비스 구현을 목표로 활동하는 동아리입니다',
  activities: [
    {
      title: '스터디',
      content: '각 파트별 스터디를 통해 프론트엔드/백엔드 지식을 학습합니다.',
      img: '/스터디.png',
    },
    {
      title: '아이디어톤',
      content:
        '팀프로젝트를 통해 실현하고 싶은 아이디어(웹서비스)를 발표하는 자리이며 전국의 멋대 학생들이 모여 아이디어를 공유하는 네트워킹의 장입니다.',
      img: '/아이디어톤.png',
    },
    {
      title: '해커톤',
      content:
        '실제 아이디어가 구현되는 축제의 장입니다. 수 주간의 아이디어 빌드업과 프로그래밍에 이어 해커톤 당일의 밤샘 코딩 및 최종 발표를 통해 아이디어를 구현하고 소개합니다.',
      img: '/해커톤.png',
    },

    {
      title: '친목활동',
      content:
        '성공회대 멋사만의 MT, OT, 조지미 제도, 세미나 등 학교 선배, 후배, 동기와 친해지고 더불어 함께 스터디 할 수 있는 기회를 얻을 수 있습니다',
      img: '/친목.png',
    },
  ],
  recruit: [
    {
      title: '1차 서류',
      content: '2월 26일 ~ 3월 8일',
    },
    {
      title: '1차 발표',
      content: '3월 9일 ~ 3월 11일',
    },
    {
      title: '2차 면접',
      content: '3월 12일 ~ 3월 14일',
    },
    {
      title: '최종 발표',
      content: '3월 17일',
    },
    {
      title: '아기사자OT',
      content: '3월 19일',
    },
  ],
  projects: [
    {
      title: '학습장',
      content:
        '전국 각지의 공공기관에서 제공하는 다양한 평생학습 강좌의 정보를 모아둔 종합 서비스입니다.',
      img: '/학습장.png',
    },
    {
      title: '모연하다',
      content:
        '디지털 격차로 어려움을 겪는 장년층, 노년층과 격차를 줄이는데 도움을 줄 수 있는 청년들이 멘토, 멘티가 되는 서비스입니다.',
      img: '/모연하다.png',
    },
    {
      title: '머리뷰',
      content:
        '머리에 대한 모든 이야기, 머리뷰는 헤어 관련 후기나 경험을 작성하고 확인할 수 있는 사이트입니다',
      img: 'https://likelion-11th-skhu.github.io/static/img/project/8.png',
    },
    {
      title: '게더로비',
      content:
        '같은 음식점에서 음식을 함께 주문할 이웃들을 모은 뒤 대표 주문자가 주문하고 만나 배달비를 내눠 낸 다음 음식을 나눠 가질 수 있도록 돕는 서비스입니다',
      img: 'https://likelion-11th-skhu.github.io/static/img/project/10.png',
    },
    {
      title: '쓱터디',
      content:
        '스터디 모임 매칭 서비스로, 동아리나 그룹 스터디와 같은 정보는 에브리타임과 같은 특정 커뮤니티 없이는 정보를 찾기 어렵다는 문제점에서 비롯해, 스터디 그룹을 쉽게 구성하고 찾아볼 수 있게 돕는 서비스입니다.',
      img: 'https://likelion-11th-skhu.github.io/static/img/project/6.png',
    },
    {
      title: '젊어서노세',
      content:
        '중장년층을 대상으로 한 소모임 커뮤니티로,노약자를 위한 서비스가 많이 부족하고 세대 간의 소통이 단절되어 있는 현 사회상에 문제점을 느껴 기획하고 개발한 서비스입니다.',
      img: 'https://likelion-11th-skhu.github.io/static/img/project/7.png',
    },
  ],
  schedule: [
    {
      title: '전체OT',
      content: '3월 21일',
    },
    {
      title: '아이디어톤',
      content: '5월 3일 ~ 5월 21일',
    },
    {
      title: '해커톤',
      content: '7월 12일 ~ 8월 13일',
    },
    {
      title: '멋사MT',
      content: '8월 중 예정',
    },
  ],
  프론트엔드: {
    roadMap: [
      'HTML,CSS기초',
      '자바스크립트 기초/심화',
      'React 기초',
      'CSS-in-JS와 tailwind CSS',
      '전역 상태 관리',
    ],
    title:
      '프론트엔드 파트는 사용자 인터페이스를  구현하는데 초점을 맞추고 있습니다. 버튼 클릭, 이미지 슬라이드 등 사용자 경험과 사용자 인터페이스를 담당합니다.',
    content: 'HTML,CSS,javascript,React',
  },
  백엔드: {
    roadMap: [
      'Java기초 + 고급 문법',
      '데이터베이스 기초 + 모델링(ERD)',
      'Spring(프로젝트 설정, 데이터베이스 연동 등)',
      'JPA와 API통신',
      '스프링 시큐리티',
    ],
    title:
      '백엔드 파트는 HTTP 프로토콜을 기반으로 데이터를 제공하기 위한 효율적이고 체계화된 REST API 설계와 데이터베이스 관리에 초점을 맞추고 있습니다.',
    content: 'AWS,Nginx,Java,Spring Boot,JPA',
  },

  QnA: [
    {
      question: '초보(비전공자,  코딩 입문자)인데 가입해도 되나요?',
      answer:
        '물론입니다! 멋쟁이 사자처럼 수업은 코딩 경험이 없는 비전공자를 대상으로 하고 있기 때문에 지원가능합니다. 다만, 모든 활동과 수업에 대해 열심히 임할 열정과 각오는 준비되어 있어야 하고 자신만의 아이디어를 가지고 있다면 누구나 지원할 수 있습니다.',
    },
    {
      question: '노트북이 있어야 하나요?',
      answer:
        '멋쟁이사자처럼 12기 활동을 위해선 반드시 개인 노트북이 필요합니다.',
    },
    {
      question: '아이디어톤,해커톤에 전부 참여해야 하나요?',
      answer:
        '아이디어톤, 해커톤 둘 중 하나라도 참여하지 못하면 수료증이 발급되지 않습니다. 참여 못하시는 분들은 아쉽게도 지원조건에 해당되지 않습니다.',
    },
    {
      question: '회비가 있나요?',
      answer:
        '유지비로 4만원의 회비가 존재합니다. 2만원은 보증금으로 반환됩니다.',
    },
    {
      question: '정기 모임시간이 궁금합니다',
      answer:
        '매주 화요일,수요일 19:30분에 정기모임이 존재합니다. 전체 세션, 파트별 세션으로 진행됩니다.',
    },
    {
      question: '모집인원이 어떻게 되나요?',
      answer: '프론트엔드/백엔드 파트별로 각 16명씩 모집 예정입니다.',
    },
    {
      question: '세션 진행 방법이 궁금합니다',
      answer:
        '화, 수 정기 모임에 운영진들이 직접 하는 강의로 진행이 됩니다. 또한 매주 1회, 강의와 관련된 과제와 이에 대한 피드백이 진행됩니다.',
    },
    {
      question: '지원 경쟁률이 어떻게 되나요?',
      answer: '그간 경쟁률을 통합한 결과 약 3.5대 1입니다.',
    },
    {
      question: '타 동아리 중복 지원해서 가입 가능한가요 ?',
      answer:
        '강의와 과제 등, 멋사에 할애해야하는 시간이 상당하기 때문에 교내 IT동아리와 중복 지원은 지양하는 것을 추천드립니다.',
    },
    {
      question: '면접은 어떤 방식으로 진행되나요?',
      answer: '교내 강의실을 대여하여 오프라인으로 진행할 예정입니다.',
    },
  ],
};

Object.freeze(TEXT);
